# 베이스 이미지를 가져와 이미지를 생성합니다.
FROM node:14

# 도커 명령이 아래 작업폴더에서 실행하도록 명시합니다.
# Dockerfile에서 후속 ADD, COPY, CMD, ENTRYPOINT 또는 RUN 명령에 대한 작업 디렉터리를 설정합니다.
WORKDIR /app

# 첫번째 인자는 현재 디렉토리를 의미합니다.
# 두번째 인자는 도커 내부 경로를 의미합니다.
# 컨테이너 내부 /app 경로로 현재 디렉토리 파일들을 복사합니다.
COPY . /app

# 도커 컨테이너 및 이미지 작업 디렉토리에서 npm install 명령어를 실행 시킵니다.
RUN npm install

# 도커 컨테이너 내부 3000 번 포트를 노출한다고 명시합니다. (없어도 괜찮습니다.)
EXPOSE 3000

# 컨테이너가 시작될 때의 명령어를 작성합니다.
# RUN 명령어와 다른점은 RUN 명령어는 이미지가 빌드될 떄마다 실행되고 CMD는 컨테이너를 시작하는 경우에 사용됩니다.
# 서버를 실행 시키는 것은 이미지 빌드 단위가 아닌 컨테이너 실행 단위여야 합니다. (여러 컨테이너를 다루어야 하니까)
CMD [ "node", "app.mjs" ]
